; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=252, out_folder=htg/blocksworld/training, instance_id=44, seed=2068, goal_proportion=0.03

(define (problem blocksworld-44)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b47)
    (on-table b47)
    (clear b34)
    (on-table b34)
    (clear b109)
    (on b109 b226)
    (on-table b226)
    (clear b197)
    (on-table b197)
    (clear b108)
    (on b108 b252)
    (on b252 b165)
    (on b165 b66)
    (on b66 b208)
    (on b208 b15)
    (on b15 b185)
    (on b185 b13)
    (on b13 b169)
    (on b169 b74)
    (on-table b74)
    (clear b155)
    (on b155 b140)
    (on b140 b195)
    (on-table b195)
    (clear b157)
    (on b157 b149)
    (on b149 b44)
    (on b44 b126)
    (on b126 b111)
    (on b111 b65)
    (on b65 b150)
    (on b150 b248)
    (on b248 b99)
    (on b99 b58)
    (on b58 b114)
    (on-table b114)
    (clear b110)
    (on b110 b76)
    (on b76 b236)
    (on-table b236)
    (clear b81)
    (on b81 b166)
    (on-table b166)
    (clear b86)
    (on b86 b221)
    (on-table b221)
    (clear b218)
    (on b218 b42)
    (on-table b42)
    (clear b93)
    (on b93 b227)
    (on b227 b118)
    (on b118 b237)
    (on-table b237)
    (clear b89)
    (on-table b89)
    (clear b224)
    (on-table b224)
    (clear b36)
    (on b36 b146)
    (on-table b146)
    (clear b18)
    (on b18 b251)
    (on b251 b147)
    (on b147 b112)
    (on b112 b175)
    (on b175 b154)
    (on b154 b113)
    (on b113 b152)
    (on b152 b181)
    (on b181 b148)
    (on-table b148)
    (clear b21)
    (on b21 b225)
    (on b225 b193)
    (on b193 b17)
    (on-table b17)
    (clear b210)
    (on b210 b105)
    (on b105 b122)
    (on-table b122)
    (clear b196)
    (on-table b196)
    (clear b190)
    (on b190 b24)
    (on b24 b201)
    (on b201 b247)
    (on b247 b78)
    (on b78 b106)
    (on b106 b57)
    (on b57 b49)
    (on b49 b144)
    (on-table b144)
    (clear b134)
    (on b134 b10)
    (on b10 b191)
    (on b191 b71)
    (on b71 b229)
    (on-table b229)
    (clear b2)
    (on-table b2)
    (clear b228)
    (on b228 b131)
    (on b131 b11)
    (on b11 b92)
    (on b92 b129)
    (on b129 b168)
    (on-table b168)
    (clear b22)
    (on b22 b142)
    (on b142 b230)
    (on b230 b156)
    (on b156 b103)
    (on-table b103)
    (clear b104)
    (on-table b104)
    (clear b68)
    (on b68 b245)
    (on b245 b79)
    (on b79 b186)
    (on b186 b4)
    (on b4 b234)
    (on b234 b160)
    (on-table b160)
    (clear b32)
    (on b32 b125)
    (on b125 b205)
    (on b205 b172)
    (on-table b172)
    (clear b52)
    (on b52 b6)
    (on b6 b38)
    (on-table b38)
    (clear b120)
    (on b120 b179)
    (on b179 b241)
    (on b241 b159)
    (on-table b159)
    (clear b12)
    (on b12 b54)
    (on-table b54)
    (clear b204)
    (on b204 b35)
    (on-table b35)
    (clear b56)
    (on b56 b84)
    (on-table b84)
    (clear b139)
    (on b139 b167)
    (on-table b167)
    (clear b151)
    (on b151 b41)
    (on-table b41)
    (clear b250)
    (on b250 b162)
    (on b162 b117)
    (on b117 b240)
    (on b240 b73)
    (on-table b73)
    (clear b102)
    (on b102 b124)
    (on b124 b62)
    (on b62 b135)
    (on b135 b20)
    (on b20 b9)
    (on b9 b27)
    (on b27 b141)
    (on b141 b242)
    (on b242 b46)
    (on b46 b143)
    (on-table b143)
    (clear b85)
    (on b85 b97)
    (on b97 b37)
    (on b37 b5)
    (on b5 b23)
    (on b23 b82)
    (on-table b82)
    (clear b31)
    (on-table b31)
    (clear b217)
    (on b217 b91)
    (on b91 b163)
    (on-table b163)
    (clear b69)
    (on b69 b249)
    (on b249 b173)
    (on b173 b26)
    (on-table b26)
    (clear b132)
    (on b132 b116)
    (on b116 b189)
    (on-table b189)
    (clear b33)
    (on b33 b194)
    (on b194 b244)
    (on b244 b130)
    (on b130 b164)
    (on b164 b176)
    (on b176 b90)
    (on b90 b136)
    (on b136 b198)
    (on b198 b161)
    (on b161 b88)
    (on-table b88)
    (clear b133)
    (on-table b133)
    (clear b45)
    (on-table b45)
    (clear b174)
    (on b174 b223)
    (on-table b223)
    (clear b207)
    (on-table b207)
    (clear b220)
    (on b220 b40)
    (on b40 b87)
    (on-table b87)
    (clear b101)
    (on b101 b216)
    (on b216 b243)
    (on-table b243)
    (clear b8)
    (on b8 b39)
    (on b39 b115)
    (on b115 b43)
    (on b43 b206)
    (on b206 b63)
    (on-table b63)
    (clear b238)
    (on b238 b7)
    (on-table b7)
    (clear b145)
    (on-table b145)
    (clear b51)
    (on b51 b177)
    (on b177 b64)
    (on b64 b83)
    (on b83 b1)
    (on b1 b246)
    (on-table b246)
    (clear b188)
    (on b188 b70)
    (on-table b70)
    (clear b222)
    (on b222 b53)
    (on b53 b235)
    (on b235 b77)
    (on b77 b75)
    (on b75 b94)
    (on b94 b170)
    (on b170 b219)
    (on b219 b127)
    (on-table b127)
    (clear b67)
    (on b67 b202)
    (on-table b202)
    (clear b107)
    (on b107 b96)
    (on-table b96)
    (clear b239)
    (on-table b239)
    (clear b137)
    (on b137 b180)
    (on b180 b72)
    (on b72 b183)
    (on b183 b60)
    (on b60 b48)
    (on b48 b187)
    (on-table b187)
    (clear b80)
    (on b80 b59)
    (on b59 b200)
    (on b200 b182)
    (on-table b182)
    (clear b211)
    (on b211 b95)
    (on-table b95)
    (clear b215)
    (on b215 b3)
    (on-table b3)
    (clear b214)
    (on b214 b25)
    (on-table b25)
    (clear b123)
    (on b123 b138)
    (on b138 b100)
    (on b100 b29)
    (on-table b29)
    (clear b213)
    (on-table b213)
    (clear b55)
    (on-table b55)
    (clear b50)
    (on-table b50)
    (clear b233)
    (on b233 b61)
    (on b61 b158)
    (on b158 b232)
    (on b232 b209)
    (on b209 b192)
    (on b192 b28)
    (on-table b28)
    (clear b178)
    (on-table b178)
    (clear b14)
    (on b14 b98)
    (on b98 b212)
    (on-table b212)
    (clear b119)
    (on b119 b153)
    (on-table b153)
    (clear b30)
    (on-table b30)
    (clear b128)
    (on b128 b231)
    (on b231 b121)
    (on-table b121)
    (clear b203)
    (on b203 b19)
    (on b19 b184)
    (on b184 b171)
    (on b171 b199)
    (on-table b199))
 (:goal  (and 
    (clear b2)
    (on b2 b6)
    (on b6 b3)
    (on b3 b7)
    (on b7 b5)
    (on b5 b1)
    (on b1 b4)
    (on-table b4))))

; plan
1. (unstack b215 b3)
   deleted: (on b215 b3) (clear b215) (arm-empty)
   added: (holding b215) (clear b3)
   goals met: 1 of 8
2. (putdown b215)
   deleted: (holding b215)
   added: (clear b215) (arm-empty) (on-table b215)
   goals met: 1 of 8
3. (unstack b238 b7)
   deleted: (on b238 b7) (clear b238) (arm-empty)
   added: (holding b238) (clear b7)
   goals met: 1 of 8
4. (putdown b238)
   deleted: (holding b238)
   added: (clear b238) (arm-empty) (on-table b238)
   goals met: 1 of 8
5. (unstack b51 b177)
   deleted: (on b51 b177) (clear b51) (arm-empty)
   added: (holding b51) (clear b177)
   goals met: 1 of 8
6. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 1 of 8
7. (unstack b177 b64)
   deleted: (on b177 b64) (clear b177) (arm-empty)
   added: (holding b177) (clear b64)
   goals met: 1 of 8
8. (putdown b177)
   deleted: (holding b177)
   added: (clear b177) (arm-empty) (on-table b177)
   goals met: 1 of 8
9. (unstack b52 b6)
   deleted: (on b52 b6) (clear b52) (arm-empty)
   added: (holding b52) (clear b6)
   goals met: 1 of 8
10. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 1 of 8
11. (unstack b64 b83)
   deleted: (on b64 b83) (clear b64) (arm-empty)
   added: (holding b64) (clear b83)
   goals met: 1 of 8
12. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 1 of 8
13. (unstack b68 b245)
   deleted: (on b68 b245) (clear b68) (arm-empty)
   added: (holding b68) (clear b245)
   goals met: 1 of 8
14. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 1 of 8
15. (unstack b245 b79)
   deleted: (on b245 b79) (clear b245) (arm-empty)
   added: (holding b245) (clear b79)
   goals met: 1 of 8
16. (putdown b245)
   deleted: (holding b245)
   added: (clear b245) (arm-empty) (on-table b245)
   goals met: 1 of 8
17. (unstack b79 b186)
   deleted: (on b79 b186) (clear b79) (arm-empty)
   added: (holding b79) (clear b186)
   goals met: 1 of 8
18. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 1 of 8
19. (unstack b186 b4)
   deleted: (on b186 b4) (clear b186) (arm-empty)
   added: (holding b186) (clear b4)
   goals met: 1 of 8
20. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 1 of 8
21. (unstack b4 b234)
   deleted: (on b4 b234) (clear b4) (arm-empty)
   added: (holding b4) (clear b234)
   goals met: 1 of 8
22. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 8
23. (unstack b83 b1)
   deleted: (on b83 b1) (clear b83) (arm-empty)
   added: (holding b83) (clear b1)
   goals met: 2 of 8
24. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 2 of 8
25. (unstack b85 b97)
   deleted: (on b85 b97) (clear b85) (arm-empty)
   added: (holding b85) (clear b97)
   goals met: 2 of 8
26. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 2 of 8
27. (unstack b97 b37)
   deleted: (on b97 b37) (clear b97) (arm-empty)
   added: (holding b97) (clear b37)
   goals met: 2 of 8
28. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 2 of 8
29. (unstack b37 b5)
   deleted: (on b37 b5) (clear b37) (arm-empty)
   added: (holding b37) (clear b5)
   goals met: 2 of 8
30. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 2 of 8
31. (unstack b1 b246)
   deleted: (on b1 b246) (clear b1) (arm-empty)
   added: (holding b1) (clear b246)
   goals met: 2 of 8
32. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 3 of 8
33. (unstack b5 b23)
   deleted: (on b5 b23) (clear b5) (arm-empty)
   added: (holding b5) (clear b23)
   goals met: 3 of 8
34. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 4 of 8
35. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 8
36. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 5 of 8
37. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 8
38. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 6 of 8
39. (unstack b6 b38)
   deleted: (on b6 b38) (clear b6) (arm-empty)
   added: (holding b6) (clear b38)
   goals met: 6 of 8
40. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 7 of 8
41. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 8
42. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 8 of 8
